app/helpers/sessions_helper.rb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
    def current_user
        if session[:user_id]
            @current_user ||= User.find_by(id: session[:user_id])