app/controllers/sessions_controller.rb

  def create_user_post
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO `users` (`name`, `password_digest`, `email`, `created_at`, `updated_at`) VALUES ('saitou', '$2a$10$QoV12My7UwrxUoAt48zloODnlCez3CNYdCY4UjWxuFjVmZLhYgxlC', 'saitou@gmail.com', '2020-06-07 09:05:05', '2020-06-07 09:05:05')