app/controllers/tasks_controller.rb

SELECT `t_learn_contexts`.* FROM `t_learn_contexts`
---
    def index
        @learncontext = TLearnContext.all

INSERT INTO `t_learn_contexts` (`user_id`, `LearnContext`, `created_at`, `updated_at`) VALUES (1, 'aaa', '2020-06-11 15:22:27', '2020-06-11 15:22:27')
---
    def create_post
        @learncontext = TLearnContext.new(learncontext_params)
        if @learncontext.save